# Pandas Introduction Notebook #
#### by: Vincent Junitio Ungu ####
---

Hey guys! Today, I will be sharing the most recently used functions in **pandas**. At the end of this notebook, you should have these following skills:
* Create your own dataframe
* Import a file into a dataframe
* Insert a column to the dataframe
* Insert a row to the dataframe
* Drop a column or row
* Export your dataframe into *.csv*, *.txt*, *.json* file

I am using **Google Colab** since we do not need any installation, but please have your device connected to the internet. :)

If you are new to Data Science and its related field, learning **pandas** is one of the most essential skills needed and this notebook should be your first baby step to dive in these world.


---

**Note: Please imagine that I am sitting beside you and explaining this notebook to you personally.**

**Please Save a copy in Drive so you can edit in the notebook as well.**
**File** -> **Save a copy in Drive**

**You can simply click Runtime** -> **Run All, but since there are some "exercises" it will be better for you to run every cell step by step.** :D

---

Since we are using **Google Colab**, we do not need to install **pandas** library. However, we have to import it.\
Note: if you are using jupyter notebook or other python IDEs, please check on how to install **pandas**.

In [ ]:
import pandas as pd

The library name is **pandas**. To import it, we add an import before it. Next, you will see **as pd**. We call it as "aliasing" or nicknaming it as **pd**. The reason why we use "aliasing" is to make it easier for us to call/ use it later on.

## Create a Dataframe ##

After importing the library, we will make our first dataframe. Dataframe is a 2-dimensional data structure consists of rows and columns - to not be confused, you can assume it as a table (in data term).

In [ ]:
# keys = "Menu" and "Price", values = [ 'Hamburger', 'Hotdog', 'Pizza', 'Cola'] and [ 10, 5, 3, 2]

data = {
    "Menu" : ['Hamburger', 'Hotdog', 'Pizza', 'Cola'],
    "Price" : [ 10, 5, 3, 2]
}

I created a variable named **data**. This **data** is a dictionary data structure (remember that dictionary is distinguished by the curly bracket "{ ... }". 

\- Dictionary -\
Notation: { key: value}\
Example: sounds = { "Lion": "Roar", "Dog": "Bark"}\
Explanation: variable **sounds** is a dictionary of animal sounds (Lions roar, dogs bark).

\- List -\
Notation: [ ]\
Example: values = [ 1, 2, 3, 4, 5]\
Explanation: variable **values** is a list of number ranging from 1 to 5.

Note: For numbers, we can directly type it without a quotation mark " ". For words (in python known as "string"), we should add a quotation mark (ex: "Hello").

To create a dataframe, we use the below syntax. We save it as **df**.

In [ ]:
df = pd.DataFrame(data)

Now, let's call out our dataframe.

In [ ]:
df

        Menu  Price
0  Hamburger     10
1     Hotdog      5
2      Pizza      3
3       Cola      2

There are several ways to call out our dataframe.\
**(name of the dataframe)** : to call out first 5 rows and last 5 rows.\
**(name of the dataframe).head()** : to call out first 5 rows.\
**(name of the dataframe).head(2)** : to call out first 2 rows.\
**(name of the dataframe).tail()** : to call out last 5 rows.\
**(name of the dataframe).tail(2)** : to call out last 2 rows.

---
## Your Turn! ##
Compare it with **df**.
* Try to use **.head(2)**. Can you spot the difference?
* Try to use **print(df)**. Can you spot the difference?
* Try to use **.tail(1)**. Can you spot the difference?
---

In [ ]:
#use .head(2)

In [ ]:
#use print(df)

In [ ]:
#use .tail(1)

## Import a file ##

In real world, there are tons of datasets available. Should we recreate all the data manually :")?

Chill friends, **pandas** supports file import  -  **.read_csv()**.\
Suppose we have a file named "Menu.csv". (csv stands for comma-separated values).

In [ ]:
# Please run the code below - this explanation will be provided by the end of this notebook.
df.to_csv("Menu.csv", index = False)

Let's import the file.

In [ ]:
df = pd.read_csv("Menu.csv")

Please remember since we have aliased **pandas** as **pd** so we have to use **pd.read_csv** instead of **pandas.read_csv**.

In [ ]:
df

        Menu  Price
0  Hamburger     10
1     Hotdog      5
2      Pizza      3
3       Cola      2

Yay! Now, we have succesfully import a file and read it into our dataframe.

We are going deeper now. Let's examine what are the columns' data type in our dataframe. **.info()** gives you the information of the columns in our dataframe.\
After that, if we want to see the overall description of our dataframe, we can use **.describe()**.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Menu    4 non-null      object
 1   Price   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [ ]:
df.describe()

           Price
count   4.000000
mean    5.000000
std     3.559026
min     2.000000
25%     2.750000
50%     4.000000
75%     6.250000
max    10.000000

* count = number of rows
* mean = the average of "Price"
* std = the standard deviation
* min = the minimum value
* 25%, 50%, 75% = 25th, 50th, 75th percentiles respectively
* max = the maximum value

## Insert a Column ##

Let's say we want to add a new column named "Discount". The discount is 20% of the price. We will do it manually.

In [ ]:
discount = [ 2, 1, 0.6, 0.4]

To insert a new column at a specified index, we use **.insert()**

In [ ]:
df.insert(1, "Discount", discount)

Please have a look at the cell above. We are going to insert a new column named "Discount", in which the data is saved in **discount** at position *1*.

By default, all the index numbers (rows and columns) start from 0. "Menu" is at index 0, so inserting "Discount" at index 1 will set this column right beside "Menu".

In [ ]:
df

        Menu  Discount  Price
0  Hamburger       2.0     10
1     Hotdog       1.0      5
2      Pizza       0.6      3
3       Cola       0.4      2

Our dataframe **df** has a new column now.

---
## Your Turn! ##
Please change the **df.insert(1, "Discount, discount)** to:
* **df.insert(2, "Discount", discount)**. Is there any error?
* **df.insert(3, "Discount", discount)**. Is there any error?
---

In [ ]:
# df.insert(2, "Discount", discount)

In [ ]:
df_new = pd.read_csv("Menu.csv")

# df_new.insert(3, "Discount", discount)

## Create a new column with Arithmetic Operation ##

Say we want to add a column named *Discounted_Price*. It is a bit boring if we do it manually. Let's handle it with arithmetic operation - substraction in this case. If we want to get the discounted price of our menu, we can simply substract the price with the discount price.

In [ ]:
df['Discounted_Price'] = df['Price'] - df['Discount']

In [ ]:
df

        Menu  Discount  Price  Discounted_Price
0  Hamburger       2.0     10               8.0
1     Hotdog       1.0      5               4.0
2      Pizza       0.6      3               2.4
3       Cola       0.4      2               1.6

Did you notice something?

We have just added/ inserted a new column named "Discounted_Price" but we are not using **df.insert()**. In **pandas**, if we create a new column in a dataframe, it will directly place the new column to the last column (rightmost column).

## Insert a new row into the dataframe ##

We have learned how to insert a column, now we will learn how to insert a new row.\
To add a new row, we use **.append()**.

In [ ]:
df = df.append({"Menu":"Fries", "Price": 4}, ignore_index = True)

Can you guess what are we going to add?

Yes! We are going to add "Fries" to our "Menu" column with its "Price" is 4 dollars.

In [ ]:
df

        Menu  Discount  Price  Discounted_Price
0  Hamburger       2.0     10               8.0
1     Hotdog       1.0      5               4.0
2      Pizza       0.6      3               2.4
3       Cola       0.4      2               1.6
4      Fries       NaN      4               NaN

Wait a minute! There is something strange in our **df**. What is "NaN"? 

NaN stands for Not a Number. Please review one cell before. We currently have 4 columns (Menu, Discount, Price, and Discounted_Price) but we only state the value of "Menu" and "Price". Since the "Price" and "Discounted_Price" are not stated, then these values will be "NaN".

As I have mentioned before, the discount is 20%. Let's count the discount value once again using arithmetic operation.

Previously, we have created "Discount" column. Please check what happened if we declare the same name of the column again.

In [ ]:
df['Discount'] = 0.2 * df['Price']

In [ ]:
df

        Menu  Discount  Price  Discounted_Price
0  Hamburger       2.0     10               8.0
1     Hotdog       1.0      5               4.0
2      Pizza       0.6      3               2.4
3       Cola       0.4      2               1.6
4      Fries       0.8      4               NaN

It will replace the (old) "Discount" column. Now we have our discount value for "Fries". To get the "Discounted_Price", we can simply rerun the cell which contains the substraction between "Price" and "Discount".

In [ ]:
df['Discounted_Price'] = df['Price'] - df['Discount']
df

        Menu  Discount  Price  Discounted_Price
0  Hamburger       2.0     10               8.0
1     Hotdog       1.0      5               4.0
2      Pizza       0.6      3               2.4
3       Cola       0.4      2               1.6
4      Fries       0.8      4               3.2

Hooray! Our **df** is free from "NaN" now. That's simply how we add a row.

## Find value in the dataframe ##

Suppose we are going to select certain columns with its values, "Menu" and "Discounted_Price". Here's how we run the code.

In [ ]:
selected_columns = ["Menu", "Discounted_Price"]
df[selected_columns]

        Menu  Discounted_Price
0  Hamburger               8.0
1     Hotdog               4.0
2      Pizza               2.4
3       Cola               1.6
4      Fries               3.2

That's how we deal with finding columns. For finding values in rows, we use **.loc()**.

Suppose we are going to select the "Menu" which "Price" is less than 10 dollars. Here's how we run the code.

In [ ]:
df.loc[df['Price']<10]["Menu"]

1    Hotdog
2     Pizza
3      Cola
4     Fries
Name: Menu, dtype: object

Can we find the value of the row at a specific index? Yes! Suppose we are going to search the value at index 2. We use **iloc()** with i stands for integer-based indexing. Here's how we run the code.

In [ ]:
df.iloc[2]

Menu                Pizza
Discount              0.6
Price                   3
Discounted_Price      2.4
Name: 2, dtype: object

---
## Your Turn! ##
* Find the "Menu" in which its "Discounted_Price" is greater than 2.
* Try to run df.loc[ df['Price'] < 10]. Compare it with df.loc[df['Price'] < 10]["Menu"]. Can you spot the difference?
* Find the dataframe which "Menu" is Hotdog. Please note that since Hotdog is a string data type, do not forget to put quotation mark between Hotdog. 
---

In [ ]:
# Find the "Menu" in which its "Discounted_Price" is greater than 2

In [ ]:
# df.loc[df['Price'] < 10]

In [ ]:
# Find the dataframe which "Menu" is Hotdog. Please note that since Hotdog is a string data type, do not forget to put quotation mark between Hotdog.

## Drop column or row ##

In some cases, not all columns and rows are needed and being processed. We can simply drop them with **.drop()**.

We have counted the "Discounted_Price" and we do not need "Discount" column anymore. Let's drop this column.

In [ ]:
df = df.drop("Discount", axis = 1)

In [ ]:
df

        Menu  Price  Discounted_Price
0  Hamburger     10               8.0
1     Hotdog      5               4.0
2      Pizza      3               2.4
3       Cola      2               1.6
4      Fries      4               3.2

What is axis? Axis has 2 values (0 or 1). If we set axis = 1, we will drop the column (from top to bottom). However if we set axis = 0, we will drop the row (from left to right).

In [ ]:
df = df.drop(0, axis = 0)

In [ ]:
df

     Menu  Price  Discounted_Price
1  Hotdog      5               4.0
2   Pizza      3               2.4
3    Cola      2               1.6
4   Fries      4               3.2

We drop our index 0 row! Now we have dataframe with index 1 to 4.

Talking about index, can we change the index?

Of course! Suppose we are going to change the index to "Menu_1", "Menu_2", "Menu_3", and "Menu_4". Here's how we run the code.

In [ ]:
index_name = ["Menu_1", "Menu_2", "Menu_3", "Menu_4"]
df.index = index_name

In [ ]:
df

          Menu  Price  Discounted_Price
Menu_1  Hotdog      5               4.0
Menu_2   Pizza      3               2.4
Menu_3    Cola      2               1.6
Menu_4   Fries      4               3.2

Suppose that we want to change the index back to number (starts from 0). We will use **.reset_index()**.

In [ ]:
df = df.reset_index()

In [ ]:
df

    index    Menu  Price  Discounted_Price
0  Menu_1  Hotdog      5               4.0
1  Menu_2   Pizza      3               2.4
2  Menu_3    Cola      2               1.6
3  Menu_4   Fries      4               3.2

Oh no! We have our index back started from 0 but we also have a new column named "index". There is two simple ways to handle this. 

**First way**, we can simply drop the "index" column.\
**Second way**, please review back few cells above. (I will provide it below as well)\
"\
index_name = [ "Menu_1", "Menu_2", "Menu_3", "Menu_4"]\
df.index = index_name\
"\
However we are not going to use **df.reset_index()**. Instead, we redeclare the **index_name** variable.\
index_name = [ 0, 1, 2, 3]\
df.index = index_name

We will use the **first way** since it is easier to drop a column instead of redeclaring the variables (this will be hard if our dataframe consists of thousands of rows).

In [ ]:
df = df.drop(["index"], axis = 1)

In [ ]:
df

     Menu  Price  Discounted_Price
0  Hotdog      5               4.0
1   Pizza      3               2.4
2    Cola      2               1.6
3   Fries      4               3.2

## Export dataframe to a file ##

To export a file, we will use **.to_csv()**.

Suppose we are going to export **df** to .csv file.

In [ ]:
df.to_csv("Menu.csv", index = False)

The code above export **df** to a file named "Menu.csv" (the extension of the file is .csv). *index = False* means we do not want to include the index.

Can we export this dataframe to .txt or .json file? Absolutely yes! Repeat the cell above but make sure you change the extension to *.txt* or *.json*.

In [ ]:
df.to_csv("Menu.txt", index = False)

In [ ]:
df.to_csv("Menu.json", index = False)

Here's another question. What if we want our file to be seperated by a tab space ("\t")? Let's use *.txt* extension for this example.

In [ ]:
df.to_csv("Menu.txt", sep = "\t", index = False)

We add a new parameter *sep = "\t"* to state that we want the value to be (sep)erated by a tab space ("\t").

Please see your left window in the **Google Colab**. You should have seen "Menu.csv", "Menu.txt", "Menu.json" files.\
We are going to import "Menu.txt" back! Do you still remember how to import a file :)?

![alt text]()

To import file we will use **pd.read_csv()**. Hey! Our file is now *.txt*, should we still be using **pd.read_csv()**?\
Let's try it and see what will happen.

In [ ]:
menu = pd.read_csv("Menu.txt")

In [ ]:
menu

  Menu\tPrice\tDiscounted_Price
0                Hotdog\t5\t4.0
1                 Pizza\t3\t2.4
2                  Cola\t2\t1.6
3                 Fries\t4\t3.2

Magic! **pd.read_csv()** can read *.txt* file but did you see something strange?\
There are "\t". This occured because we saved the file with tab space ("\t") as its seperator.\
We have to get back to **pd.read_csv()** and add a **sep** parameter to get rid of these "\t".

In [ ]:
menu = pd.read_csv("Menu.txt", sep = "\t")

In [ ]:
menu

     Menu  Price  Discounted_Price
0  Hotdog      5               4.0
1   Pizza      3               2.4
2    Cola      2               1.6
3   Fries      4               3.2

"\t" byebye! :D

## Hooray! ##
We have come to an end of our *Pandas Introduction Notebook*. 

A quick recap of what we have learned:
* Create your own dataframe
* Import a file into a dataframe
* Insert a column to the dataframe
* Insert a row to the dataframe
* Drop a column or row
* Export your dataframe into .csv, .txt, .json file

This notebook should have covered the most recently used **pandas** functions in Data Science, Machine Learning and other related fields. I really hope you enjoy this notebook and interested to dive deeper in these field of study. Please feel free to contact me if you find anything difficult. Thank you and happy learning :D.